# IFC_ImportLibrary

## Description
Imports IFC Library of objects

```pascal
FUNCTION IFC_ImportLibrary(
				strFilePath    : STRING;
				bKeepHierarchy : BOOLEAN) : BOOLEAN;
```

```python

def vs.IFC_ImportLibrary(strFilePath, bKeepHierarchy):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|strFilePath|STRING||
|bKeepHierarchy|BOOLEAN||

## Version
Availability: from Vectorworks 2014
## Category
* IFC